# Дана строка текста. Напишите программу для подсчета стоимости строки, исходя из того, что один любой символ
# (в том числе пробел) стоит  60 60 копеек. Ответ дайте в рублях и копейках в соответствии с примерами.  Формат входных данных На вход программе подается строка текста.
# Формат выходных данных Программа должна вывести стоимость строки
str_1 = len(input('Введите строку: '))
print(str_1)

